In [36]:
import numpy as np 
import pandas as pd
#pandas handle very large data
#great data representation

# Important Keyboard shortcuts
## press Y for converting to code
## press M for converting to markdown
## press shift + tab for tooltip
## ctl + enter 
## shift + enter
## alt + enter
## B
## D
## 1,2,3,4,5
## * 
## **
## ***
## ctr +s

In [ ]:
#### Pandas generally provide two data structure for manipulating data:
❖ Series: it is like a column in a table. It is a one-dimensional 
array holding data of any type.
❖ DataFrame: it is a 2-dimensional data structure, like a 2-
dimensional array, or a table with rows and columns

In [14]:
x=pd.Series([123,12121,551],index=['a','b','c'])
print(x)

a      123
b    12121
c      551
dtype: int64

In [27]:
day={'saturday':0,'sunday':1,'monday':2}
x=pd.Series(day)
print(x)

saturday    0
sunday      1
monday      2
dtype: int64

In [30]:
day={'saturday':0,'sunday':1,'monday':2}
y=pd.DataFrame(day,index=[1,2])
print(y)

   saturday  sunday  monday
1         0       1       2
2         0       1       2

In [21]:
employee={'number':[1,2,3],'name':["mohamed","mostafa","mahmoud"],'salary':[2000,1000,3000]}
company={'number':[1,2,3],'name':["google","intel","telsa"],'salary':[2000,1000,3000]}

In [22]:
table1=pd.DataFrame(employee)
table2=pd.DataFrame(company)

In [42]:
fusion=pd.merge(table1,table2)
print(fusion)
table1.dtypes

Empty DataFrame
Columns: [number, name, salary]
Index: []

number     int64
name      object
salary     int64
dtype: object

In [33]:
fusion=pd.merge(table1,table2,on='number')

In [34]:
print(fusion)

   number   name_x  salary_x  name_y  salary_y
0       1  mohamed      2000  google      2000
1       2  mostafa      1000   intel      1000
2       3  mahmoud      3000   telsa      3000

In [35]:
fusion.head()

   number   name_x  salary_x  name_y  salary_y
0       1  mohamed      2000  google      2000
1       2  mostafa      1000   intel      1000
2       3  mahmoud      3000   telsa      3000

In [89]:
fusion.tail(1)

   number   name_x  salary_x   name_y  salary_y
2       3  mahmoud      3000  mahmoud      3000

In [91]:
employee1={'number':[1,2,3],'name':["mohamed","mostafa","mahmoud"],'salary':[2000,1000,3000]}
company1={'cname':["google","intel","tesla"],'csalary':[2000,1000,3000]}
table1=pd.DataFrame(employee1)
table2=pd.DataFrame(company1)
fus=table1.join(table2)

In [92]:
print(fus)

   number     name  salary   cname  csalary
0       1  mohamed    2000  google     2000
1       2  mostafa    1000   intel     1000
2       3  mahmoud    3000   tesla     3000

In [38]:
t=pd.read_csv('F:\\mohamed\\Machine Learning\\ml.tasks\\task 5\\titanic\\train.csv')

In [52]:
t.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [47]:
t.columns.values

array(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'], dtype=object)

In [51]:
t.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [53]:
t.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [59]:
t[['PassengerId','Survived']] #extract columns

     PassengerId  Survived
0              1         0
1              2         1
2              3         1
3              4         1
4              5         0
..           ...       ...
886          887         0
887          888         1
888          889         0
889          890         1
890          891         0

[891 rows x 2 columns]

In [60]:
t.loc[[0]]#extract rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [105]:
t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [118]:
t['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [114]:
t[(t['Survived']>0)&(t['Sex']=="female")]#describe()#count()# filer by specific conditions

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S

In [113]:
x=(t['Sex']=="female")
x.head()

0    False
1     True
2     True
3     True
4    False
Name: Sex, dtype: bool

In [119]:
t['Fare'].sum()
t['Fare'].mean()
t[['Fare','Age']].min()

Fare    0.00
Age     0.42
dtype: float64

In [167]:
x=t.groupby("Sex")
x.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [151]:
x=t.groupby(['Sex'])[['Survived']].sum()
x.head()

        Survived
Sex
female       233
male         109

In [171]:
x=t.groupby(['Sex'])[['Survived']].agg({'Survived':['sum','max']})
x.head()

       Survived
            sum max
Sex
female      233   1
male        109   1

In [139]:
t['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

# Data cleaning (Extra Info)
❖ Data cleaning means fixing bad data in your data set.

❖ Bad data could be:

❖ Empty cells

❖ Data in wrong format

❖ Wrong data

❖ Duplicates

## solutions of empty cells 
***❖if empty cells is about 75% of the feture then delete it***

***❖or fill them by using mode or median or mean***

***you can choose the best of them by seeing the distryibution of the feature to find the best one***

In [219]:
a=pd.read_csv('F:\\mohamed\\Machine Learning\\ml.tasks\\task 5\\titanic\\train.csv')
a.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [220]:
a['Age'].isnull().sum()

177

In [201]:
x=a['Age'].mean()
a['Age'].fillna(x,inplace=True)
a.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [202]:
a['Age'].isnull().sum()

0

In [225]:
one_hot = pd.get_dummies(a['Embarked'])
one_hot

     C  Q  S
0    0  0  1
1    1  0  0
2    0  0  1
3    0  0  1
4    0  0  1
..  .. .. ..
886  0  0  1
887  0  0  1
888  0  0  1
889  1  0  0
890  0  1  0

[891 rows x 3 columns]

## Data Cleaning – Wrong Format
❖ To fix wrong format data, you have two options:

❖ Remove the rows

❖ Convert all cells in the columns into the same format

## Data Cleaning – Wrong Data Con…

❖ Ways to deal with wrong data

❖ Replace wrong data

❖ Remove rows

## Data Cleaning – Duplicates

❖ Duplicate rows are rows that have been registered more than one time.

❖ Discovering duplicates:
    
❖ Remove duplicates

In [223]:
a.duplicated().sum()

0

In [210]:
a.drop_duplicates(inplace=True)

In [102]:
#try it on pycharm then create html file and copy the code in your file into this new html file
x=pd.read_csv('C:\\Users\\Mohamed\\Documents\\Book1.csv')
x.to_html("myhtml")

[[1 'mm']
 [2 'nn']
 [3 'bb']]